package info.vladyslav.codeLibrary.basics;

public class InitializationVariables {
    /**
     * нестатический контекст
     */
    // объявление полей (в таблицах поле -> это столбец)
    private int a, b, c, d, e, f;

    // будет ошибка компиляции,
    // a = 10;
    /**
     * присвоить не в статическом контексте, если переменная уже объявлена,
     * можно только через конструктор
     */

    // присвоение значения через конструктор
    public InitializationVariables() {
        a = 10;
    }
//----------------------------------------------------------------------------------
    // объявление с динамическим присвоением
    int a1 = 1, b1 = 2, c1 = 3, d1 = 4;

//----------------------------------------------------------------------------------
    // объявление массивов
    int nums [];

    public static void main(String[] args) {

    }


}
